espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_gpio_port.h
#define _GPIO_P_MODEL_MODE3_INPUTPULLFILTER            0x00000003UL                                        /**< Mode INPUTPULLFILTER for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE3_PUSHPULL                   0x00000004UL                                        /**< Mode PUSHPULL for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE3_PUSHPULLALT                0x00000005UL                                        /**< Mode PUSHPULLALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE3_WIREDOR                    0x00000006UL                                        /**< Mode WIREDOR for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE3_WIREDORPULLDOWN            0x00000007UL                                        /**< Mode WIREDORPULLDOWN for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE3_WIREDAND                   0x00000008UL                                        /**< Mode WIREDAND for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE3_WIREDANDFILTER             0x00000009UL                                        /**< Mode WIREDANDFILTER for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE3_WIREDANDPULLUP             0x0000000AUL                                        /**< Mode WIREDANDPULLUP for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE3_WIREDANDPULLUPFILTER       0x0000000BUL                                        /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEL  */
#define _GPIO_P_MODEL_MODE3_WIREDANDALT                0x0000000CUL                                        /**< Mode WIREDANDALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE3_WIREDANDALTFILTER          0x0000000DUL                                        /**< Mode WIREDANDALTFILTER for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE3_WIREDANDALTPULLUP          0x0000000EUL                                        /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE3_WIREDANDALTPULLUPFILTER    0x0000000FUL                                        /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_DEFAULT                     (_GPIO_P_MODEL_MODE3_DEFAULT << 12)                 /**< Shifted mode DEFAULT for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE3_DISABLED                    (_GPIO_P_MODEL_MODE3_DISABLED << 12)                /**< Shifted mode DISABLED for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE3_INPUT                       (_GPIO_P_MODEL_MODE3_INPUT << 12)                   /**< Shifted mode INPUT for GPIO_P_MODEL         */
#define GPIO_P_MODEL_MODE3_INPUTPULL                   (_GPIO_P_MODEL_MODE3_INPUTPULL << 12)               /**< Shifted mode INPUTPULL for GPIO_P_MODEL     */
#define GPIO_P_MODEL_MODE3_INPUTPULLFILTER             (_GPIO_P_MODEL_MODE3_INPUTPULLFILTER << 12)         /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_PUSHPULL                    (_GPIO_P_MODEL_MODE3_PUSHPULL << 12)                /**< Shifted mode PUSHPULL for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE3_PUSHPULLALT                 (_GPIO_P_MODEL_MODE3_PUSHPULLALT << 12)             /**< Shifted mode PUSHPULLALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE3_WIREDOR                     (_GPIO_P_MODEL_MODE3_WIREDOR << 12)                 /**< Shifted mode WIREDOR for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE3_WIREDORPULLDOWN             (_GPIO_P_MODEL_MODE3_WIREDORPULLDOWN << 12)         /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDAND                    (_GPIO_P_MODEL_MODE3_WIREDAND << 12)                /**< Shifted mode WIREDAND for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE3_WIREDANDFILTER              (_GPIO_P_MODEL_MODE3_WIREDANDFILTER << 12)          /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDANDPULLUP              (_GPIO_P_MODEL_MODE3_WIREDANDPULLUP << 12)          /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDANDPULLUPFILTER        (_GPIO_P_MODEL_MODE3_WIREDANDPULLUPFILTER << 12)    /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDANDALT                 (_GPIO_P_MODEL_MODE3_WIREDANDALT << 12)             /**< Shifted mode WIREDANDALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE3_WIREDANDALTFILTER           (_GPIO_P_MODEL_MODE3_WIREDANDALTFILTER << 12)       /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDANDALTPULLUP           (_GPIO_P_MODEL_MODE3_WIREDANDALTPULLUP << 12)       /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE3_WIREDANDALTPULLUPFILTER     (_GPIO_P_MODEL_MODE3_WIREDANDALTPULLUPFILTER << 12) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define _GPIO_P_MODEL_MODE4_SHIFT                      16                                                  /**< Shift value for GPIO_MODE4                  */
#define _GPIO_P_MODEL_MODE4_MASK                       0xF0000UL                                           /**< Bit mask for GPIO_MODE4                     */
#define _GPIO_P_MODEL_MODE4_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE4_DISABLED                   0x00000000UL                                        /**< Mode DISABLED for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE4_INPUT                      0x00000001UL                                        /**< Mode INPUT for GPIO_P_MODEL                 */
#define _GPIO_P_MODEL_MODE4_INPUTPULL                  0x00000002UL                                        /**< Mode INPUTPULL for GPIO_P_MODEL             */
#define _GPIO_P_MODEL_MODE4_INPUTPULLFILTER            0x00000003UL                                        /**< Mode INPUTPULLFILTER for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE4_PUSHPULL                   0x00000004UL                                        /**< Mode PUSHPULL for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE4_PUSHPULLALT                0x00000005UL                                        /**< Mode PUSHPULLALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE4_WIREDOR                    0x00000006UL                                        /**< Mode WIREDOR for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE4_WIREDORPULLDOWN            0x00000007UL                                        /**< Mode WIREDORPULLDOWN for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE4_WIREDAND                   0x00000008UL                                        /**< Mode WIREDAND for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE4_WIREDANDFILTER             0x00000009UL                                        /**< Mode WIREDANDFILTER for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE4_WIREDANDPULLUP             0x0000000AUL                                        /**< Mode WIREDANDPULLUP for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE4_WIREDANDPULLUPFILTER       0x0000000BUL                                        /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEL  */
#define _GPIO_P_MODEL_MODE4_WIREDANDALT                0x0000000CUL                                        /**< Mode WIREDANDALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE4_WIREDANDALTFILTER          0x0000000DUL                                        /**< Mode WIREDANDALTFILTER for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE4_WIREDANDALTPULLUP          0x0000000EUL                                        /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE4_WIREDANDALTPULLUPFILTER    0x0000000FUL                                        /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_DEFAULT                     (_GPIO_P_MODEL_MODE4_DEFAULT << 16)                 /**< Shifted mode DEFAULT for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE4_DISABLED                    (_GPIO_P_MODEL_MODE4_DISABLED << 16)                /**< Shifted mode DISABLED for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE4_INPUT                       (_GPIO_P_MODEL_MODE4_INPUT << 16)                   /**< Shifted mode INPUT for GPIO_P_MODEL         */
#define GPIO_P_MODEL_MODE4_INPUTPULL                   (_GPIO_P_MODEL_MODE4_INPUTPULL << 16)               /**< Shifted mode INPUTPULL for GPIO_P_MODEL     */
#define GPIO_P_MODEL_MODE4_INPUTPULLFILTER             (_GPIO_P_MODEL_MODE4_INPUTPULLFILTER << 16)         /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_PUSHPULL                    (_GPIO_P_MODEL_MODE4_PUSHPULL << 16)                /**< Shifted mode PUSHPULL for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE4_PUSHPULLALT                 (_GPIO_P_MODEL_MODE4_PUSHPULLALT << 16)             /**< Shifted mode PUSHPULLALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE4_WIREDOR                     (_GPIO_P_MODEL_MODE4_WIREDOR << 16)                 /**< Shifted mode WIREDOR for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE4_WIREDORPULLDOWN             (_GPIO_P_MODEL_MODE4_WIREDORPULLDOWN << 16)         /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDAND                    (_GPIO_P_MODEL_MODE4_WIREDAND << 16)                /**< Shifted mode WIREDAND for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE4_WIREDANDFILTER              (_GPIO_P_MODEL_MODE4_WIREDANDFILTER << 16)          /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDANDPULLUP              (_GPIO_P_MODEL_MODE4_WIREDANDPULLUP << 16)          /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDANDPULLUPFILTER        (_GPIO_P_MODEL_MODE4_WIREDANDPULLUPFILTER << 16)    /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDANDALT                 (_GPIO_P_MODEL_MODE4_WIREDANDALT << 16)             /**< Shifted mode WIREDANDALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE4_WIREDANDALTFILTER           (_GPIO_P_MODEL_MODE4_WIREDANDALTFILTER << 16)       /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDANDALTPULLUP           (_GPIO_P_MODEL_MODE4_WIREDANDALTPULLUP << 16)       /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE4_WIREDANDALTPULLUPFILTER     (_GPIO_P_MODEL_MODE4_WIREDANDALTPULLUPFILTER << 16) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define _GPIO_P_MODEL_MODE5_SHIFT                      20                                                  /**< Shift value for GPIO_MODE5                  */
#define _GPIO_P_MODEL_MODE5_MASK                       0xF00000UL                                          /**< Bit mask for GPIO_MODE5                     */
#define _GPIO_P_MODEL_MODE5_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE5_DISABLED                   0x00000000UL                                        /**< Mode DISABLED for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE5_INPUT                      0x00000001UL                                        /**< Mode INPUT for GPIO_P_MODEL                 */
#define _GPIO_P_MODEL_MODE5_INPUTPULL                  0x00000002UL                                        /**< Mode INPUTPULL for GPIO_P_MODEL             */
#define _GPIO_P_MODEL_MODE5_INPUTPULLFILTER            0x00000003UL                                        /**< Mode INPUTPULLFILTER for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE5_PUSHPULL                   0x00000004UL                                        /**< Mode PUSHPULL for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE5_PUSHPULLALT                0x00000005UL                                        /**< Mode PUSHPULLALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE5_WIREDOR                    0x00000006UL                                        /**< Mode WIREDOR for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE5_WIREDORPULLDOWN            0x00000007UL                                        /**< Mode WIREDORPULLDOWN for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE5_WIREDAND                   0x00000008UL                                        /**< Mode WIREDAND for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE5_WIREDANDFILTER             0x00000009UL                                        /**< Mode WIREDANDFILTER for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE5_WIREDANDPULLUP             0x0000000AUL                                        /**< Mode WIREDANDPULLUP for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE5_WIREDANDPULLUPFILTER       0x0000000BUL                                        /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEL  */
#define _GPIO_P_MODEL_MODE5_WIREDANDALT                0x0000000CUL                                        /**< Mode WIREDANDALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE5_WIREDANDALTFILTER          0x0000000DUL                                        /**< Mode WIREDANDALTFILTER for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE5_WIREDANDALTPULLUP          0x0000000EUL                                        /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE5_WIREDANDALTPULLUPFILTER    0x0000000FUL                                        /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_DEFAULT                     (_GPIO_P_MODEL_MODE5_DEFAULT << 20)                 /**< Shifted mode DEFAULT for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE5_DISABLED                    (_GPIO_P_MODEL_MODE5_DISABLED << 20)                /**< Shifted mode DISABLED for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE5_INPUT                       (_GPIO_P_MODEL_MODE5_INPUT << 20)                   /**< Shifted mode INPUT for GPIO_P_MODEL         */
#define GPIO_P_MODEL_MODE5_INPUTPULL                   (_GPIO_P_MODEL_MODE5_INPUTPULL << 20)               /**< Shifted mode INPUTPULL for GPIO_P_MODEL     */
#define GPIO_P_MODEL_MODE5_INPUTPULLFILTER             (_GPIO_P_MODEL_MODE5_INPUTPULLFILTER << 20)         /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_PUSHPULL                    (_GPIO_P_MODEL_MODE5_PUSHPULL << 20)                /**< Shifted mode PUSHPULL for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE5_PUSHPULLALT                 (_GPIO_P_MODEL_MODE5_PUSHPULLALT << 20)             /**< Shifted mode PUSHPULLALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE5_WIREDOR                     (_GPIO_P_MODEL_MODE5_WIREDOR << 20)                 /**< Shifted mode WIREDOR for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE5_WIREDORPULLDOWN             (_GPIO_P_MODEL_MODE5_WIREDORPULLDOWN << 20)         /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDAND                    (_GPIO_P_MODEL_MODE5_WIREDAND << 20)                /**< Shifted mode WIREDAND for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE5_WIREDANDFILTER              (_GPIO_P_MODEL_MODE5_WIREDANDFILTER << 20)          /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDANDPULLUP              (_GPIO_P_MODEL_MODE5_WIREDANDPULLUP << 20)          /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDANDPULLUPFILTER        (_GPIO_P_MODEL_MODE5_WIREDANDPULLUPFILTER << 20)    /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDANDALT                 (_GPIO_P_MODEL_MODE5_WIREDANDALT << 20)             /**< Shifted mode WIREDANDALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE5_WIREDANDALTFILTER           (_GPIO_P_MODEL_MODE5_WIREDANDALTFILTER << 20)       /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDANDALTPULLUP           (_GPIO_P_MODEL_MODE5_WIREDANDALTPULLUP << 20)       /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE5_WIREDANDALTPULLUPFILTER     (_GPIO_P_MODEL_MODE5_WIREDANDALTPULLUPFILTER << 20) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define _GPIO_P_MODEL_MODE6_SHIFT                      24                                                  /**< Shift value for GPIO_MODE6                  */
#define _GPIO_P_MODEL_MODE6_MASK                       0xF000000UL                                         /**< Bit mask for GPIO_MODE6                     */
#define _GPIO_P_MODEL_MODE6_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE6_DISABLED                   0x00000000UL                                        /**< Mode DISABLED for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE6_INPUT                      0x00000001UL                                        /**< Mode INPUT for GPIO_P_MODEL                 */
#define _GPIO_P_MODEL_MODE6_INPUTPULL                  0x00000002UL                                        /**< Mode INPUTPULL for GPIO_P_MODEL             */
#define _GPIO_P_MODEL_MODE6_INPUTPULLFILTER            0x00000003UL                                        /**< Mode INPUTPULLFILTER for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE6_PUSHPULL                   0x00000004UL                                        /**< Mode PUSHPULL for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE6_PUSHPULLALT                0x00000005UL                                        /**< Mode PUSHPULLALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE6_WIREDOR                    0x00000006UL                                        /**< Mode WIREDOR for GPIO_P_MODEL               */
#define _GPIO_P_MODEL_MODE6_WIREDORPULLDOWN            0x00000007UL                                        /**< Mode WIREDORPULLDOWN for GPIO_P_MODEL       */
#define _GPIO_P_MODEL_MODE6_WIREDAND                   0x00000008UL                                        /**< Mode WIREDAND for GPIO_P_MODEL              */
#define _GPIO_P_MODEL_MODE6_WIREDANDFILTER             0x00000009UL                                        /**< Mode WIREDANDFILTER for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE6_WIREDANDPULLUP             0x0000000AUL                                        /**< Mode WIREDANDPULLUP for GPIO_P_MODEL        */
#define _GPIO_P_MODEL_MODE6_WIREDANDPULLUPFILTER       0x0000000BUL                                        /**< Mode WIREDANDPULLUPFILTER for GPIO_P_MODEL  */
#define _GPIO_P_MODEL_MODE6_WIREDANDALT                0x0000000CUL                                        /**< Mode WIREDANDALT for GPIO_P_MODEL           */
#define _GPIO_P_MODEL_MODE6_WIREDANDALTFILTER          0x0000000DUL                                        /**< Mode WIREDANDALTFILTER for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE6_WIREDANDALTPULLUP          0x0000000EUL                                        /**< Mode WIREDANDALTPULLUP for GPIO_P_MODEL     */
#define _GPIO_P_MODEL_MODE6_WIREDANDALTPULLUPFILTER    0x0000000FUL                                        /**< Mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_DEFAULT                     (_GPIO_P_MODEL_MODE6_DEFAULT << 24)                 /**< Shifted mode DEFAULT for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE6_DISABLED                    (_GPIO_P_MODEL_MODE6_DISABLED << 24)                /**< Shifted mode DISABLED for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE6_INPUT                       (_GPIO_P_MODEL_MODE6_INPUT << 24)                   /**< Shifted mode INPUT for GPIO_P_MODEL         */
#define GPIO_P_MODEL_MODE6_INPUTPULL                   (_GPIO_P_MODEL_MODE6_INPUTPULL << 24)               /**< Shifted mode INPUTPULL for GPIO_P_MODEL     */
#define GPIO_P_MODEL_MODE6_INPUTPULLFILTER             (_GPIO_P_MODEL_MODE6_INPUTPULLFILTER << 24)         /**< Shifted mode INPUTPULLFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_PUSHPULL                    (_GPIO_P_MODEL_MODE6_PUSHPULL << 24)                /**< Shifted mode PUSHPULL for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE6_PUSHPULLALT                 (_GPIO_P_MODEL_MODE6_PUSHPULLALT << 24)             /**< Shifted mode PUSHPULLALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE6_WIREDOR                     (_GPIO_P_MODEL_MODE6_WIREDOR << 24)                 /**< Shifted mode WIREDOR for GPIO_P_MODEL       */
#define GPIO_P_MODEL_MODE6_WIREDORPULLDOWN             (_GPIO_P_MODEL_MODE6_WIREDORPULLDOWN << 24)         /**< Shifted mode WIREDORPULLDOWN for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDAND                    (_GPIO_P_MODEL_MODE6_WIREDAND << 24)                /**< Shifted mode WIREDAND for GPIO_P_MODEL      */
#define GPIO_P_MODEL_MODE6_WIREDANDFILTER              (_GPIO_P_MODEL_MODE6_WIREDANDFILTER << 24)          /**< Shifted mode WIREDANDFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDANDPULLUP              (_GPIO_P_MODEL_MODE6_WIREDANDPULLUP << 24)          /**< Shifted mode WIREDANDPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDANDPULLUPFILTER        (_GPIO_P_MODEL_MODE6_WIREDANDPULLUPFILTER << 24)    /**< Shifted mode WIREDANDPULLUPFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDANDALT                 (_GPIO_P_MODEL_MODE6_WIREDANDALT << 24)             /**< Shifted mode WIREDANDALT for GPIO_P_MODEL   */
#define GPIO_P_MODEL_MODE6_WIREDANDALTFILTER           (_GPIO_P_MODEL_MODE6_WIREDANDALTFILTER << 24)       /**< Shifted mode WIREDANDALTFILTER for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDANDALTPULLUP           (_GPIO_P_MODEL_MODE6_WIREDANDALTPULLUP << 24)       /**< Shifted mode WIREDANDALTPULLUP for GPIO_P_MODEL*/
#define GPIO_P_MODEL_MODE6_WIREDANDALTPULLUPFILTER     (_GPIO_P_MODEL_MODE6_WIREDANDALTPULLUPFILTER << 24) /**< Shifted mode WIREDANDALTPULLUPFILTER for GPIO_P_MODEL*/

